biyifeidemo/app/controllers/flightlines_controller.rb

  def index
    @flightlines = Flightline.all
---
SELECT * FROM `flightlines`

  def show
    @flightline = Flightline.find(params[:id])
---
SELECT * FROM `flightlines` WHERE (`flightlines`.`id` = 1)

  def edit
    @flightline = Flightline.find(params[:id])
---
SELECT * FROM `flightlines` WHERE (`flightlines`.`id` = 1)

  def create
    @flightline = Flightline.new(params[:flightline])

    respond_to do |format|
      if @flightline.save
---
INSERT INTO `flightlines` (`traveltype`, `updated_at`, `fltcombin`, `prikey_id`, `created_at`) VALUES(1, '2013-06-22 13:37:16', 'CZ3339,KE1000/CZ3338', 1, '2013-06-22 13:37:16')

  def update
    @flightline = Flightline.find(params[:id])

    respond_to do |format|
      if @flightline.update_attributes(params[:flightline])
---
SELECT * FROM `flightlines` WHERE (`flightlines`.`id` = 1)
UPDATE `flightlines` SET `fltcombin` = 'KE1000/CZ3338', `updated_at` = '2013-06-22 13:37:46' WHERE `id` = 1