biyifeidemo/app/controllers/prices_controller.rb

  def index
    @prices = Price.all
---
SELECT * FROM `prices`

  def show
    @price = Price.find(params[:id])
---
SELECT * FROM `prices` WHERE (`prices`.`id` = 1)

  def edit
    @price = Price.find(params[:id])
---
SELECT * FROM `prices` WHERE (`prices`.`id` = 1)

  def create
    @price = Price.new(params[:price])

    respond_to do |format|
      if @price.save
---
INSERT INTO `prices` (`hashvalue_price`, `updated_at`, `flightline_id`, `created_at`, `hashid_date`) VALUES('{\r\n \"prices\": {\r\n \"cangwei_index\": [\r\n \"Q\",\r\n \"Y\"\r\n ],\r\n \"price_data\": [\r\n {\r\n \"ctrip\": \"1000\",\r\n \"itour\": \"1500\"\r\n },\r\n {\r\n \"itour\": \"1500\"\r\n }\r\n ]\r\n },\r\n \"bunks\": {\r\n \"cangwei_data\": [\r\n \"8\",\r\n \"S\",\r\n \"A\",\r\n \"5\",\r\n \"5\",\r\n \"1\",\r\n \"S\",\r\n \"S\",\r\n \"S\",\r\n \"S\",\r\n \"A\",\r\n \"S\",\r\n \"S\",\r\n \"S\",\r\n \"S\"\r\n ],\r\n \"cangwei_data_sort\": null,\r\n \"cangwei_index\": [\r\n \"F\",\r\n \"A\",\r\n \"Y\",\r\n \"B\",\r\n \"M\",\r\n \"H\",\r\n \"K\",\r\n \"L\",\r\n \"Q\",\r\n \"G\",\r\n \"S\",\r\n \"N\",\r\n \"V\",\r\n \"T\",\r\n \"E\"\r\n ],\r\n \"cangwei_index_sort\": null,\r\n \"cangwei_subclass_data\": [\r\n null,\r\n null,\r\n null,\r\n null,\r\n [\r\n \"5\"\r\n ],\r\n null,\r\n null,\r\n null,\r\n null,\r\n null,\r\n null,\r\n null,\r\n [\r\n \"S\"\r\n ],\r\n null,\r\n null\r\n ],\r\n \"cangwei_subclass_index\": [\r\n null,\r\n null,\r\n null,\r\n null,\r\n [\r\n \"M1\"\r\n ],\r\n null,\r\n null,\r\n null,\r\n null,\r\n null,\r\n null,\r\n null,\r\n [\r\n \"V1\"\r\n ],\r\n null,\r\n null\r\n ]\r\n }\r\n}', '2013-06-22 14:25:43', 1, '2013-06-22 14:25:43', 20130901)

  def update
    @price = Price.find(params[:id])

    respond_to do |format|
      if @price.update_attributes(params[:price])
---
SELECT * FROM `prices` WHERE (`prices`.`id` = 1)
UPDATE `prices` SET `updated_at` = '2013-06-22 14:29:28', `flightline_id` = 3 WHERE `id` = 1