biyifeidemo/app/controllers/prikeys_controller.rb

  def index
    @prikeys = Prikey.all
---
SELECT * FROM `prikeys`

  def show
    @prikey = Prikey.find(params[:id])
---
SELECT * FROM `prikeys` WHERE (`prikeys`.`id` = 1)

  def edit
    @prikey = Prikey.find(params[:id])
---
SELECT * FROM `prikeys` WHERE (`prikeys`.`id` = 1)

  def create
    @prikey = Prikey.new(params[:prikey])

    respond_to do |format|
      if @prikey.save
---
INSERT INTO `prikeys` (`updated_at`, `hashvalue_flts`, `created_at`, `name`, `hashid_date`) VALUES('2013-06-22 13:34:01', '{\r\n \"sum\": 9,\r\n \"f_num\": 3,\r\n \"flts\": [\r\n {\r\n \"airline\": \"CZ\",\r\n \"f_id\": [\r\n 1,\r\n 2,\r\n 3\r\n ]\r\n },\r\n {\r\n \"airline\": \"KE\",\r\n \"f_id\": [\r\n 1,\r\n 4,\r\n 5,\r\n 6\r\n ]\r\n },\r\n {\r\n \"airline\": \"MU\",\r\n \"f_id\": [\r\n 7,\r\n 8,\r\n 9\r\n ]\r\n }\r\n ]\r\n}', '2013-06-22 13:34:01', 'can/lax/ow/', 20130901)

  def update
    @prikey = Prikey.find(params[:id])

    respond_to do |format|
      if @prikey.update_attributes(params[:prikey])
---
SELECT * FROM `prikeys` WHERE (`prikeys`.`id` = 1)
UPDATE `prikeys` SET `hashvalue_flts` = '{\r\n \"sum\": 9,\r\n \"f_num\": 3,\r\n \"flts\": [\r\n {\r\n \"airline\": \"CZ\",\r\n \"f_id\": [\r\n 1,\r\n 2,\r\n 3\r\n ]\r\n },\r\n {\r\n \"airline\": \"KE\",\r\n \"f_id\": [\r\n 1,\r\n 4,\r\n 5\r\n ]\r\n },\r\n {\r\n \"airline\": \"MU\",\r\n \"f_id\": [\r\n 7,\r\n 8,\r\n 9\r\n ]\r\n }\r\n ]\r\n}', `updated_at` = '2013-06-22 13:46:58' WHERE `id` = 1