biyifeidemo/app/controllers/segments_controller.rb

SELECT * FROM `segments`
---
  def index
    @segments = Segment.all

SELECT * FROM `segments` WHERE (`segments`.`id` = 1)
---
  def show
    @segment = Segment.find(params[:id])

SELECT * FROM `segments` WHERE (`segments`.`id` = 1)
---
  def edit
    @segment = Segment.find(params[:id])

INSERT INTO `segments` (`segnum`, `updated_at`, `flightline_id`, `created_at`, `segmentinfo`) VALUES(1, '2013-06-22 14:13:06', 1, '2013-06-22 14:13:06', '[\r\n {\r\n \"airline\": \"CZ3338/KE1000\",\r\n \"arriTerm\": \"T2\",\r\n \"arriTime\": \"1000\",\r\n \"arriveDate\": \"{hashid_date+1} 10:00:00\",\r\n \"arriveTimeModify\": null,\r\n \"asr\": \"true\",\r\n \"depDate\": \"{hashid_date} 07:50:00\",\r\n \"depTerm\": \"--\",\r\n \"depTime\": \"0750\",\r\n \"deptimemodify\": null,\r\n \"dstcity\": \"LAX\",\r\n \"etkt\": \"true\",\r\n \"link\": \"DS#\",\r\n \"meal\": \"S\",\r\n \"orgcity\": \"CAN\",\r\n \"planestyle\": \"73G\",\r\n \"selectedClass\": \"$\",\r\n \"stopNumber\": \"0\"\r\n }\r\n]')
---
  def create
    @segment = Segment.new(params[:segment])

    respond_to do |format|
      if @segment.save